/* automatically generated by rust-bindgen 0.69.4 */

pub const GSS_C_DELEG_FLAG: u32 = 1;
pub const GSS_C_MUTUAL_FLAG: u32 = 2;
pub const GSS_C_REPLAY_FLAG: u32 = 4;
pub const GSS_C_SEQUENCE_FLAG: u32 = 8;
pub const GSS_C_CONF_FLAG: u32 = 16;
pub const GSS_C_INTEG_FLAG: u32 = 32;
pub const GSS_C_ANON_FLAG: u32 = 64;
pub const GSS_C_PROT_READY_FLAG: u32 = 128;
pub const GSS_C_TRANS_FLAG: u32 = 256;
pub const GSS_C_DELEG_POLICY_FLAG: u32 = 32768;
pub const GSS_C_NO_UI_FLAG: u32 = 2147483648;
pub const GSS_C_BOTH: u32 = 0;
pub const GSS_C_INITIATE: u32 = 1;
pub const GSS_C_ACCEPT: u32 = 2;
pub const GSS_C_OPTION_MASK: u32 = 65535;
pub const GSS_C_CRED_NO_UI: u32 = 65536;
pub const GSS_C_GSS_CODE: u32 = 1;
pub const GSS_C_MECH_CODE: u32 = 2;
pub const GSS_C_AF_UNSPEC: u32 = 0;
pub const GSS_C_AF_LOCAL: u32 = 1;
pub const GSS_C_AF_INET: u32 = 2;
pub const GSS_C_AF_IMPLINK: u32 = 3;
pub const GSS_C_AF_PUP: u32 = 4;
pub const GSS_C_AF_CHAOS: u32 = 5;
pub const GSS_C_AF_NS: u32 = 6;
pub const GSS_C_AF_NBS: u32 = 7;
pub const GSS_C_AF_ECMA: u32 = 8;
pub const GSS_C_AF_DATAKIT: u32 = 9;
pub const GSS_C_AF_CCITT: u32 = 10;
pub const GSS_C_AF_SNA: u32 = 11;
pub const GSS_C_AF_DECnet: u32 = 12;
pub const GSS_C_AF_DLI: u32 = 13;
pub const GSS_C_AF_LAT: u32 = 14;
pub const GSS_C_AF_HYLINK: u32 = 15;
pub const GSS_C_AF_APPLETALK: u32 = 16;
pub const GSS_C_AF_BSC: u32 = 17;
pub const GSS_C_AF_DSS: u32 = 18;
pub const GSS_C_AF_OSI: u32 = 19;
pub const GSS_C_AF_X25: u32 = 21;
pub const GSS_C_AF_NULLADDR: u32 = 255;
pub const GSS_C_QOP_DEFAULT: u32 = 0;
pub const GSS_S_COMPLETE: u32 = 0;
pub const GSS_C_CALLING_ERROR_OFFSET: u32 = 24;
pub const GSS_C_ROUTINE_ERROR_OFFSET: u32 = 16;
pub const GSS_C_SUPPLEMENTARY_OFFSET: u32 = 0;
pub const GSS_S_CONTINUE_NEEDED: u32 = 1;
pub const GSS_S_DUPLICATE_TOKEN: u32 = 2;
pub const GSS_S_OLD_TOKEN: u32 = 4;
pub const GSS_S_UNSEQ_TOKEN: u32 = 8;
pub const GSS_S_GAP_TOKEN: u32 = 16;
pub const GSS_KRB5_UI_ALLOW: u32 = 1;
pub const GSS_KRB5_UI_DENY: u32 = 2;
pub const GSS_KRB5_UI_PROBE: u32 = 3;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gss_name_struct {
    _unused: [u8; 0],
}
pub type gss_name_t = *mut gss_name_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gss_cred_id_struct {
    _unused: [u8; 0],
}
pub type gss_cred_id_t = *mut gss_cred_id_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gss_ctx_id_struct {
    _unused: [u8; 0],
}
pub type gss_ctx_id_t = *mut gss_ctx_id_struct;
pub type gss_uint32 = u32;
pub type gss_int32 = i32;
pub type OM_uint32 = gss_uint32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gss_OID_desc_struct {
    pub length: OM_uint32,
    pub elements: *mut ::std::os::raw::c_void,
}
const _: () = {
    ["Size of gss_OID_desc_struct"][::std::mem::size_of::<gss_OID_desc_struct>() - 16usize];
    ["Alignment of gss_OID_desc_struct"][::std::mem::align_of::<gss_OID_desc_struct>() - 8usize];
    ["Offset of field: gss_OID_desc_struct::length"]
        [::std::mem::offset_of!(gss_OID_desc_struct, length) - 0usize];
    ["Offset of field: gss_OID_desc_struct::elements"]
        [::std::mem::offset_of!(gss_OID_desc_struct, elements) - 8usize];
};
pub type gss_OID_desc = gss_OID_desc_struct;
pub type gss_OID = *mut gss_OID_desc_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gss_OID_set_desc_struct {
    pub count: usize,
    pub elements: gss_OID,
}
const _: () = {
    ["Size of gss_OID_set_desc_struct"][::std::mem::size_of::<gss_OID_set_desc_struct>() - 16usize];
    ["Alignment of gss_OID_set_desc_struct"]
        [::std::mem::align_of::<gss_OID_set_desc_struct>() - 8usize];
    ["Offset of field: gss_OID_set_desc_struct::count"]
        [::std::mem::offset_of!(gss_OID_set_desc_struct, count) - 0usize];
    ["Offset of field: gss_OID_set_desc_struct::elements"]
        [::std::mem::offset_of!(gss_OID_set_desc_struct, elements) - 8usize];
};
pub type gss_OID_set_desc = gss_OID_set_desc_struct;
pub type gss_OID_set = *mut gss_OID_set_desc_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gss_buffer_desc_struct {
    pub length: usize,
    pub value: *mut ::std::os::raw::c_void,
}
const _: () = {
    ["Size of gss_buffer_desc_struct"][::std::mem::size_of::<gss_buffer_desc_struct>() - 16usize];
    ["Alignment of gss_buffer_desc_struct"]
        [::std::mem::align_of::<gss_buffer_desc_struct>() - 8usize];
    ["Offset of field: gss_buffer_desc_struct::length"]
        [::std::mem::offset_of!(gss_buffer_desc_struct, length) - 0usize];
    ["Offset of field: gss_buffer_desc_struct::value"]
        [::std::mem::offset_of!(gss_buffer_desc_struct, value) - 8usize];
};
pub type gss_buffer_desc = gss_buffer_desc_struct;
pub type gss_buffer_t = *mut gss_buffer_desc_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gss_channel_bindings_struct {
    pub initiator_addrtype: OM_uint32,
    pub initiator_address: gss_buffer_desc,
    pub acceptor_addrtype: OM_uint32,
    pub acceptor_address: gss_buffer_desc,
    pub application_data: gss_buffer_desc,
}
const _: () = {
    ["Size of gss_channel_bindings_struct"]
        [::std::mem::size_of::<gss_channel_bindings_struct>() - 64usize];
    ["Alignment of gss_channel_bindings_struct"]
        [::std::mem::align_of::<gss_channel_bindings_struct>() - 8usize];
    ["Offset of field: gss_channel_bindings_struct::initiator_addrtype"]
        [::std::mem::offset_of!(gss_channel_bindings_struct, initiator_addrtype) - 0usize];
    ["Offset of field: gss_channel_bindings_struct::initiator_address"]
        [::std::mem::offset_of!(gss_channel_bindings_struct, initiator_address) - 8usize];
    ["Offset of field: gss_channel_bindings_struct::acceptor_addrtype"]
        [::std::mem::offset_of!(gss_channel_bindings_struct, acceptor_addrtype) - 24usize];
    ["Offset of field: gss_channel_bindings_struct::acceptor_address"]
        [::std::mem::offset_of!(gss_channel_bindings_struct, acceptor_address) - 32usize];
    ["Offset of field: gss_channel_bindings_struct::application_data"]
        [::std::mem::offset_of!(gss_channel_bindings_struct, application_data) - 48usize];
};
pub type gss_channel_bindings_t = *mut gss_channel_bindings_struct;
pub type gss_qop_t = OM_uint32;
pub type gss_cred_usage_t = ::std::os::raw::c_int;
pub type krb5_int32 = ::std::os::raw::c_int;
pub type krb5_enctype = krb5_int32;
pub type krb5_flags = krb5_int32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _krb5_ccache {
    _unused: [u8; 0],
}
pub type krb5_ccache = *mut _krb5_ccache;
pub type gss_uint64 = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gss_krb5_lucid_key {
    pub type_: OM_uint32,
    pub length: OM_uint32,
    pub data: *mut ::std::os::raw::c_void,
}
const _: () = {
    ["Size of gss_krb5_lucid_key"][::std::mem::size_of::<gss_krb5_lucid_key>() - 16usize];
    ["Alignment of gss_krb5_lucid_key"][::std::mem::align_of::<gss_krb5_lucid_key>() - 8usize];
    ["Offset of field: gss_krb5_lucid_key::type_"]
        [::std::mem::offset_of!(gss_krb5_lucid_key, type_) - 0usize];
    ["Offset of field: gss_krb5_lucid_key::length"]
        [::std::mem::offset_of!(gss_krb5_lucid_key, length) - 4usize];
    ["Offset of field: gss_krb5_lucid_key::data"]
        [::std::mem::offset_of!(gss_krb5_lucid_key, data) - 8usize];
};
pub type gss_krb5_lucid_key_t = gss_krb5_lucid_key;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gss_krb5_rfc1964_keydata {
    pub sign_alg: OM_uint32,
    pub seal_alg: OM_uint32,
    pub ctx_key: gss_krb5_lucid_key_t,
}
const _: () = {
    ["Size of gss_krb5_rfc1964_keydata"]
        [::std::mem::size_of::<gss_krb5_rfc1964_keydata>() - 24usize];
    ["Alignment of gss_krb5_rfc1964_keydata"]
        [::std::mem::align_of::<gss_krb5_rfc1964_keydata>() - 8usize];
    ["Offset of field: gss_krb5_rfc1964_keydata::sign_alg"]
        [::std::mem::offset_of!(gss_krb5_rfc1964_keydata, sign_alg) - 0usize];
    ["Offset of field: gss_krb5_rfc1964_keydata::seal_alg"]
        [::std::mem::offset_of!(gss_krb5_rfc1964_keydata, seal_alg) - 4usize];
    ["Offset of field: gss_krb5_rfc1964_keydata::ctx_key"]
        [::std::mem::offset_of!(gss_krb5_rfc1964_keydata, ctx_key) - 8usize];
};
pub type gss_krb5_rfc1964_keydata_t = gss_krb5_rfc1964_keydata;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gss_krb5_cfx_keydata {
    pub have_acceptor_subkey: OM_uint32,
    pub ctx_key: gss_krb5_lucid_key_t,
    pub acceptor_subkey: gss_krb5_lucid_key_t,
}
const _: () = {
    ["Size of gss_krb5_cfx_keydata"][::std::mem::size_of::<gss_krb5_cfx_keydata>() - 40usize];
    ["Alignment of gss_krb5_cfx_keydata"][::std::mem::align_of::<gss_krb5_cfx_keydata>() - 8usize];
    ["Offset of field: gss_krb5_cfx_keydata::have_acceptor_subkey"]
        [::std::mem::offset_of!(gss_krb5_cfx_keydata, have_acceptor_subkey) - 0usize];
    ["Offset of field: gss_krb5_cfx_keydata::ctx_key"]
        [::std::mem::offset_of!(gss_krb5_cfx_keydata, ctx_key) - 8usize];
    ["Offset of field: gss_krb5_cfx_keydata::acceptor_subkey"]
        [::std::mem::offset_of!(gss_krb5_cfx_keydata, acceptor_subkey) - 24usize];
};
pub type gss_krb5_cfx_keydata_t = gss_krb5_cfx_keydata;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gss_krb5_lucid_context_v1 {
    pub version: OM_uint32,
    pub initiate: OM_uint32,
    pub endtime: OM_uint32,
    pub send_seq: gss_uint64,
    pub recv_seq: gss_uint64,
    pub protocol: OM_uint32,
    pub rfc1964_kd: gss_krb5_rfc1964_keydata_t,
    pub cfx_kd: gss_krb5_cfx_keydata_t,
}
const _: () = {
    ["Size of gss_krb5_lucid_context_v1"]
        [::std::mem::size_of::<gss_krb5_lucid_context_v1>() - 104usize];
    ["Alignment of gss_krb5_lucid_context_v1"]
        [::std::mem::align_of::<gss_krb5_lucid_context_v1>() - 8usize];
    ["Offset of field: gss_krb5_lucid_context_v1::version"]
        [::std::mem::offset_of!(gss_krb5_lucid_context_v1, version) - 0usize];
    ["Offset of field: gss_krb5_lucid_context_v1::initiate"]
        [::std::mem::offset_of!(gss_krb5_lucid_context_v1, initiate) - 4usize];
    ["Offset of field: gss_krb5_lucid_context_v1::endtime"]
        [::std::mem::offset_of!(gss_krb5_lucid_context_v1, endtime) - 8usize];
    ["Offset of field: gss_krb5_lucid_context_v1::send_seq"]
        [::std::mem::offset_of!(gss_krb5_lucid_context_v1, send_seq) - 16usize];
    ["Offset of field: gss_krb5_lucid_context_v1::recv_seq"]
        [::std::mem::offset_of!(gss_krb5_lucid_context_v1, recv_seq) - 24usize];
    ["Offset of field: gss_krb5_lucid_context_v1::protocol"]
        [::std::mem::offset_of!(gss_krb5_lucid_context_v1, protocol) - 32usize];
    ["Offset of field: gss_krb5_lucid_context_v1::rfc1964_kd"]
        [::std::mem::offset_of!(gss_krb5_lucid_context_v1, rfc1964_kd) - 40usize];
    ["Offset of field: gss_krb5_lucid_context_v1::cfx_kd"]
        [::std::mem::offset_of!(gss_krb5_lucid_context_v1, cfx_kd) - 64usize];
};
pub type gss_krb5_lucid_context_v1_t = gss_krb5_lucid_context_v1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gss_krb5_lucid_context_version {
    pub version: OM_uint32,
}
const _: () = {
    ["Size of gss_krb5_lucid_context_version"]
        [::std::mem::size_of::<gss_krb5_lucid_context_version>() - 4usize];
    ["Alignment of gss_krb5_lucid_context_version"]
        [::std::mem::align_of::<gss_krb5_lucid_context_version>() - 4usize];
    ["Offset of field: gss_krb5_lucid_context_version::version"]
        [::std::mem::offset_of!(gss_krb5_lucid_context_version, version) - 0usize];
};
pub type gss_krb5_lucid_context_version_t = gss_krb5_lucid_context_version;
pub const _GSS_C_INDEFINITE: OM_uint32 = 4294967295;
pub const _GSS_C_CALLING_ERROR_MASK: OM_uint32 = 255;
pub const _GSS_C_ROUTINE_ERROR_MASK: OM_uint32 = 255;
pub const _GSS_C_SUPPLEMENTARY_MASK: OM_uint32 = 65535;
pub const _GSS_S_CALL_INACCESSIBLE_READ: OM_uint32 = 16777216;
pub const _GSS_S_CALL_INACCESSIBLE_WRITE: OM_uint32 = 33554432;
pub const _GSS_S_CALL_BAD_STRUCTURE: OM_uint32 = 50331648;
pub const _GSS_S_BAD_MECH: OM_uint32 = 65536;
pub const _GSS_S_BAD_NAME: OM_uint32 = 131072;
pub const _GSS_S_BAD_NAMETYPE: OM_uint32 = 196608;
pub const _GSS_S_BAD_BINDINGS: OM_uint32 = 262144;
pub const _GSS_S_BAD_STATUS: OM_uint32 = 327680;
pub const _GSS_S_BAD_SIG: OM_uint32 = 393216;
pub const _GSS_S_BAD_MIC: OM_uint32 = 393216;
